In [1]:
%load_ext sql

In [2]:
%sql postgresql://postgres:DataEng007@127.0.0.1/sparkifydb

'Connected: postgres@sparkifydb'

In [3]:
%sql SELECT * from songplays LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(1, datetime.datetime(2018, 11, 21, 0, 57, 58, 796000), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (2, datetime.datetime(2018, 11, 21, 0, 58, 41, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (3, datetime.datetime(2018, 11, 21, 1, 2, 5, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"'),
 (4, datetime.datetime(2018, 11, 21, 1, 3, 13, 796000), 80, 'paid', None, None, 774, 'Portland-South Portland, ME', '"Mozilla/5.0 (Macintosh; Intel Mac OS X 10_9_4) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/36.0.1985.143 Safari/537.36"'),
 (5, datetime.datetime(2018, 11, 21, 1, 5, 29, 796000), 97, 'paid', None, None, 671, 'Lansing-East Lansing, MI', '"Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/37.0.2062.94 Safari/537.36"')]

In [4]:
%sql SELECT * from users LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(62, 'Connar', 'Moreno', 'M', 'free'),
 (72, 'Hayden', 'Brock', 'F', 'paid'),
 (65, 'Amiya', 'Davidson', 'F', 'paid'),
 (59, 'Lily', 'Cooper', 'F', 'free'),
 (20, 'Aiden', 'Ramirez', 'M', 'paid')]

In [5]:
%sql SELECT * from songs LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('SOCIWDW12A8C13D406', 'Soul Deep', 'ARMJAGH1187FB546F3', 1969, 148.035),
 ('SOFSOCN12A8C143F5D', 'Face the Ashes', 'ARXR32B1187FB57099', 2007, 209.606),
 ('SONHOTT12A8C13493C', 'Something Girls', 'AR7G5I41187FB4CE6C', 1982, 233.404),
 ('SOHKNRJ12A6701D1F8', 'Drop of Rain', 'AR10USD1187B99F3F1', 0, 189.57),
 ('SOMZWCG12A8C13C480', "I Didn't Mean To", 'ARD7TVE1187B99BFB1', 0, 218.932)]

In [6]:
%sql SELECT * from artists LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[('ARMJAGH1187FB546F3', 'The Box Tops', 'Memphis, TN', 35.1497, -90.0489),
 ('ARXR32B1187FB57099', 'Gob', '', nan, nan),
 ('AR7G5I41187FB4CE6C', 'Adam Ant', 'London, England', nan, nan),
 ('AR10USD1187B99F3F1', 'Tweeterfriendly Music', 'Burlington, Ontario, Canada', nan, nan),
 ('ARD7TVE1187B99BFB1', 'Casual', 'California - LA', nan, nan)]

In [7]:
%sql SELECT * from time LIMIT 5;

 * postgresql://postgres:***@127.0.0.1/sparkifydb
5 rows affected.

[(datetime.datetime(2018, 11, 21, 0, 57, 58, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 0, 58, 41, 796000), 0, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 2, 5, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 3, 13, 796000), 1, 21, 47, 11, 2018, 2),
 (datetime.datetime(2018, 11, 21, 1, 5, 29, 796000), 1, 21, 47, 11, 2018, 2)]